Res-perfCacheNStatA-media/Res-container-random-v1/container_t_10_c_30_composeReviewServiceCore_4_wrkCore_1_R_2000/wrk.txt
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  10 threads and 30 connections
  Thread calibration: mean lat.: 2064.687ms, rate sampling interval: 7249ms
  Thread calibration: mean lat.: 2102.441ms, rate sampling interval: 7827ms
  Thread calibration: mean lat.: 2144.333ms, rate sampling interval: 7532ms
  Thread calibration: mean lat.: 2213.834ms, rate sampling interval: 7565ms
  Thread calibration: mean lat.: 2165.874ms, rate sampling interval: 7626ms
  Thread calibration: mean lat.: 2258.401ms, rate sampling interval: 7720ms
  Thread calibration: mean lat.: 2117.577ms, rate sampling interval: 7036ms
  Thread calibration: mean lat.: 2096.863ms, rate sampling interval: 7241ms
  Thread calibration: mean lat.: 2047.636ms, rate sampling interval: 7307ms
  Thread calibration: mean lat.: 2052.493ms, rate sampling interval: 7225ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.38s     6.23s   26.30s    56.92%
    Req/Sec   113.70      7.19   122.00     68.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.46s 
 75.000%   19.60s 
 90.000%   23.04s 
 99.000%   26.30s 
 99.900%   27.12s 
 99.990%   27.39s 
 99.999%   27.48s 
100.000%   27.53s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3405.823     0.000000            1         1.00
    5996.543     0.100000         5645         1.11
    7868.415     0.200000        11276         1.25
    9773.055     0.300000        16907         1.43
   12378.111     0.400000        22543         1.67
   14458.879     0.500000        28175         2.00
   15392.767     0.550000        30997         2.22
   16261.119     0.600000        33826         2.50
   17203.199     0.650000        36655         2.86
   18251.775     0.700000        39474         3.33
   19595.263     0.750000        42258         4.00
   20447.231     0.775000        43662         4.44
   20922.367     0.800000        45090         5.00
   21446.655     0.825000        46508         5.71
   21970.943     0.850000        47895         6.67
   22511.615     0.875000        49299         8.00
   22773.759     0.887500        50034         8.89
   23035.903     0.900000        50715        10.00
   23314.431     0.912500        51435        11.43
   23609.343     0.925000        52111        13.33
   23937.023     0.937500        52825        16.00
   24084.479     0.943750        53178        17.78
   24297.471     0.950000        53531        20.00
   24543.231     0.956250        53879        22.86
   24772.607     0.962500        54254        26.67
   24969.215     0.968750        54597        32.00
   25067.519     0.971875        54755        35.56
   25165.823     0.975000        54946        40.00
   25264.127     0.978125        55107        45.71
   25395.199     0.981250        55289        53.33
   25542.655     0.984375        55456        64.00
   25739.263     0.985938        55548        71.11
   25935.871     0.987500        55641        80.00
   26165.247     0.989062        55725        91.43
   26345.471     0.990625        55820       106.67
   26427.391     0.992188        55900       128.00
   26476.543     0.992969        55946       142.22
   26525.695     0.993750        55996       160.00
   26574.847     0.994531        56043       182.86
   26640.383     0.995313        56076       213.33
   26738.687     0.996094        56131       256.00
   26755.071     0.996484        56140       284.44
   26787.839     0.996875        56163       320.00
   26836.991     0.997266        56182       365.71
   26902.527     0.997656        56204       426.67
   26968.063     0.998047        56230       512.00
   26984.447     0.998242        56237       568.89
   27033.599     0.998437        56249       640.00
   27066.367     0.998633        56264       731.43
   27099.135     0.998828        56276       853.33
   27131.903     0.999023        56284      1024.00
   27148.287     0.999121        56288      1137.78
   27164.671     0.999219        56295      1280.00
   27181.055     0.999316        56301      1462.86
   27197.439     0.999414        56304      1706.67
   27230.207     0.999512        56314      2048.00
   27230.207     0.999561        56314      2275.56
   27230.207     0.999609        56314      2560.00
   27262.975     0.999658        56319      2925.71
   27279.359     0.999707        56320      3413.33
   27328.511     0.999756        56326      4096.00
   27328.511     0.999780        56326      4551.11
   27328.511     0.999805        56326      5120.00
   27361.279     0.999829        56327      5851.43
   27377.663     0.999854        56328      6826.67
   27394.047     0.999878        56331      8192.00
   27394.047     0.999890        56331      9102.22
   27394.047     0.999902        56331     10240.00
   27459.583     0.999915        56334     11702.86
   27459.583     0.999927        56334     13653.33
   27459.583     0.999939        56334     16384.00
   27459.583     0.999945        56334     18204.44
   27459.583     0.999951        56334     20480.00
   27459.583     0.999957        56334     23405.71
   27459.583     0.999963        56334     27306.67
   27475.967     0.999969        56335     32768.00
   27475.967     0.999973        56335     36408.89
   27475.967     0.999976        56335     40960.00
   27475.967     0.999979        56335     46811.43
   27475.967     0.999982        56335     54613.33
   27525.119     0.999985        56336     65536.00
   27525.119     1.000000        56336          inf
#[Mean    =    14383.290, StdDeviation   =     6226.252]
#[Max     =    27508.736, Total count    =        56336]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  68106 requests in 1.00m, 12.16MB read
  Non-2xx or 3xx responses: 1297
Requests/sec:   1135.11
Transfer/sec:    207.62KB